Autodesk.Revit.DB.RenderNodeAction
Enumerated actions for processing a render node during custom export.
Since:
2014

Autodesk.Revit.DB.RenderNodeAction.Skip
Instruct the exporter to skip the node. It means the exporter
will not process any child nodes (nor the geometry) of the node.
The respective end-node notification will still be invoked though.

Autodesk.Revit.DB.RenderNodeAction.Proceed
Instruct the exporter to go on with processing the node. It means
the exporter will continue handling the node by processing all its
child nodes, if it has any, and their geometry where it is relevant.